gmesqui/esp32_zigbee/sdkconfig.defaults.esp32c6
# Target: ESP32-C6 Super Mini
CONFIG_IDF_TARGET="esp32c6"

# Flash: 4MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Console / native USB-C on ESP32-C6 Super Mini
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
